InformationRegisters/ВыполнениеДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеДействийСтационара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеРежима</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеСтационара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВечер</Name>
					<Comment>Для параметров Температурного листа определяет, утренний это или вечерний замер показателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ТемпературныйЛистВводПоказателей/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДатаПросмотра) Тогда
		Дата = Параметры.ДатаПросмотра;
		Если НачалоДня(Дата) = НачалоДня(ТекущаяДата()) Тогда
			Дата = НачалоДня(Дата) + (ТекущаяДата() - НачалоДня(ТекущаяДата()));
		КонецЕсли;
	Иначе
		Дата = ТекущаяДата();
	КонецЕсли;
	Дата = НачалоМинуты(Дата);
	
	ДатаЗаполнения = ТекущаяДата();
	
	Если Параметры.Свойство("Клиент") Тогда
		Пациент = Параметры.Клиент;
	Иначе
		ВызватьИсключение("Не заполнен пациент!");
	КонецЕсли;
	
	Если Параметры.Свойство("МедицинскаяКарта") Тогда
		МедицинскаяКарта = Параметры.МедицинскаяКарта;
	КонецЕсли;
	
	НастроитьЭлементыПоказателейПриСозданииНаСервере();
	
	ЭтоВечер = ТекущаяДата() - НачалоДня(ТекущаяДата())>= 50400; // Позже 14:00 - вечер.
	
	ЗаполнитьДанныеПоПациенту(Истина);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыПоказателейПриСозданииНаСервере()
	
	НазначенныеДействияСтрокой = Новый Соответствие;
	
	ПоказателиТЛ = Справочники.ДействияМедсестрыСтационара.ПоказателиЗдоровья003у();
	Для Каждого Показатель Из ПоказателиТЛ Цикл
		РаботаСФормамиКлиентСервер.УстановитьВидимостьЭлементаФормы(Элементы, Показатель.ИмяПредопределенныхДанных, Ложь);
	КонецЦикла;
	
	Для Каждого НазначенноеДействие Из Параметры.НазначенныеДействия Цикл
		Если НазначенноеДействие.Ключ.Предопределенный Тогда // Действие ТЛ
			ЭлементФормы = Элементы.Найти(НазначенноеДействие.Ключ.ИмяПредопределенныхДанных);
			Если ЭлементФормы <> Неопределено Тогда
				ЭлементФормы.Видимость = Истина;
				Если ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода Тогда
					ЭлементФормы.АвтоОтметкаНезаполненного = Истина;
				КонецЕсли;
			КонецЕсли;
			НазначенныеДействияСтрокой.Вставить(Строка(НазначенноеДействие.Ключ.ИмяПредопределенныхДанных), НазначенноеДействие.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.АртериальноеДавлениеНижнее.Видимость = Элементы.АртериальноеДавление.Видимость;
	Элементы.АртериальноеДавлениеНижнее.АвтоОтметкаНезаполненного = Элементы.АртериальноеДавление.АвтоОтметкаНезаполненного;
	
	Параметры.НазначенныеДействияСтрокой = Новый ФиксированноеСоответствие(НазначенныеДействияСтрокой);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоПациенту(Очистить = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыполнениеДействийСтационара.Клиент КАК Клиент,
		|	ВыполнениеДействийСтационара.ДействиеСтационара КАК ДействиеСтационара,
		|	ВыполнениеДействийСтационара.Значение КАК Значение,
		|	ВыполнениеДействийСтационара.ДействиеСтационара.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
		|ГДЕ
		|	ВыполнениеДействийСтационара.Клиент = &Клиент
		|	И ВыполнениеДействийСтационара.ДатаВремяВыполнения МЕЖДУ &ДатаВремяВыполненияНачало И &ДатаВремяВыполненияОкончание
		|	И ВыполнениеДействийСтационара.ДействиеСтационара.Предопределенный";
	
	Если ЭтоВечер Тогда
		 ДатаВремяВыполненияНачало = НачалоДня(Дата)+50400; // Позже 14:00 - вечер 
		 ДатаВремяВыполненияОкончание = КонецДня(Дата);
	 Иначе
		 ДатаВремяВыполненияНачало = НачалоДня(Дата);
		 ДатаВремяВыполненияОкончание = НачалоДня(Дата)+50399; // До 14:00
	 КонецЕсли;
	 
	Запрос.УстановитьПараметр("ДатаВремяВыполненияНачало", ДатаВремяВыполненияНачало);
	Запрос.УстановитьПараметр("ДатаВремяВыполненияОкончание", ДатаВремяВыполненияОкончание);
	Запрос.УстановитьПараметр("Клиент", Пациент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если Очистить Тогда
		СброситьВведенныеДанные();
	КонецЕсли;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтаФорма[ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных] = ВыборкаДетальныеЗаписи.Значение;	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура СброситьВведенныеДанные()
	
	АртериальноеДавлениеНижнее = 0;
	АртериальноеДавление  = 0;		
	Вес  = 0;
	ВыпитоЖидкости = 0;
	Дыхание = 0;
	Пульс = 0;
	Ванна = 0;	
	Стул = 0;
	СуточноеКоличествоМочи = 0;
	Температура = 0;
	НасыщениеКислородом = 0;
	ВведеноЖидностиПарентерально = 0;
	
КонецПроцедуры                                                                             	

&НаКлиенте
Процедура ДатаОсмотраПриИзменении(Элемент)
	
	КодОтвета = Вопрос("Очистить данные?", РежимДиалогаВопрос.ДаНетОтмена); 
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеПоПациенту(Истина);
	ИначеЕсли КодОтвета = КодВозвратаДиалога.Нет Тогда
	    ЗаполнитьДанныеПоПациенту(Ложь);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоВечерПриИзменении(Элемент)
	
	КодОтвета = Вопрос("Очистить данные?", РежимДиалогаВопрос.ДаНетОтмена); 
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеПоПациенту(Истина);
	ИначеЕсли КодОтвета = КодВозвратаДиалога.Нет Тогда
	    ЗаполнитьДанныеПоПациенту(Ложь);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиДанные(Команда)
	
	МсРеквизитов = ПолучитьМассивРеквизитов();
	
	СтруктураВозврата = Новый Структура("Данные", Новый Структура("ЭтоВечер, Дата", ЭтоВечер, Дата));
	
	МсРезультат = Новый Массив;

	Для каждого РеквизитФормы Из МсРеквизитов Цикл
		Если ЗначениеЗаполнено(ЭтаФорма[РеквизитФормы]) Тогда
			Если ТипЗнч(ЭтаФорма[РеквизитФормы]) = Тип("Булево") И НЕ ЭтаФорма[РеквизитФормы] Тогда // Пропустим булевые неотмеченные значения
				Продолжить;
			КонецЕсли;
			
			Если Параметры.НазначенныеДействияСтрокой.Получить(РеквизитФормы) <> Неопределено Тогда	 // Назначенное
				ИдЭлемента = Новый УникальныйИдентификатор(Параметры.НазначенныеДействияСтрокой[РеквизитФормы].ИдентификаторДействия);
				ИдДействия = Параметры.НазначенныеДействияСтрокой[РеквизитФормы].ИдентификаторДействия;
				ДокументИзмененияРежима = Параметры.НазначенныеДействияСтрокой[РеквизитФормы].ДокументИзмененияРежима;
			Иначе
				ИдЭлемента = Новый УникальныйИдентификатор();
				ИдДействия = Новый УникальныйИдентификатор();
				ДокументИзмененияРежима = Неопределено;
			КонецЕсли;
			
			СтруктураДанных = Новый Структура("Ключ, Значение, ИдентификаторЭлемента, ИдентификаторДействия, ДокументИзмененияРежима, ЭтоПерезапись, Количество", 
												РеквизитФормы, 
												ЭтаФорма[РеквизитФормы], 
												ИдЭлемента,
												ИдДействия, 
												ДокументИзмененияРежима, 
												Ложь, 1);
			МсРезультат.Добавить(СтруктураДанных);	
		КонецЕсли; 
	КонецЦикла;
	СтруктураВозврата.Вставить("Результат", МсРезультат);
	Закрыть(СтруктураВозврата); 
  
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивРеквизитов()
	
	МсРеквизитов = Новый Массив;
	МсРеквизитов.Добавить("АртериальноеДавлениеНижнее");
	МсРеквизитов.Добавить("АртериальноеДавление");
	МсРеквизитов.Добавить("Вес");
	МсРеквизитов.Добавить("ВыпитоЖидкости");
	МсРеквизитов.Добавить("Дыхание");
	МсРеквизитов.Добавить("Пульс");
	МсРеквизитов.Добавить("Ванна");
	МсРеквизитов.Добавить("Стул");
	МсРеквизитов.Добавить("СуточноеКоличествоМочи");
	МсРеквизитов.Добавить("Температура");
	МсРеквизитов.Добавить("НасыщениеКислородом");
	МсРеквизитов.Добавить("ВведеноЖидностиПарентерально");
	
	Возврат МсРеквизитов;

КонецФункции

&НаКлиенте
Процедура ТемператураРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Температура = 0 Тогда
		Температура = 36.6;
	Иначе
		Температура = Температура + 0.1 * Направление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Ожидание = 0 Тогда
		
		ВыделенныеЗначения = Новый Массив;
		Если Элемент = Элементы.Температура Тогда
			Начало = 36.4;
			Конец = 41;
			Шаг = 0.1;
			ВыделенныеЗначения.Добавить(36.6);
			ВыделенныеЗначения.Добавить(37);
			ВыделенныеЗначения.Добавить(38);
			ВыделенныеЗначения.Добавить(39);
			ВыделенныеЗначения.Добавить(40);
			
		ИначеЕсли Элемент = Элементы.АртериальноеДавление Тогда
			Начало = 80;
			Конец = 200;
			Шаг = 5;
			ВыделенныеЗначения.Добавить(120);

		ИначеЕсли Элемент = Элементы.АртериальноеДавлениеНижнее Тогда
			Начало = 40;
			Конец = 120;
			Шаг = 5;
			ВыделенныеЗначения.Добавить(80);
			
		ИначеЕсли Элемент = Элементы.Пульс Тогда
			Начало = 55;
			Конец = 90;
			Шаг = 1;
			ВыделенныеЗначения.Добавить(60);
			ВыделенныеЗначения.Добавить(70);
			ВыделенныеЗначения.Добавить(80);
			ВыделенныеЗначения.Добавить(85);
			
		ИначеЕсли Элемент = Элементы.Дыхание Тогда
			Начало = 11;
			Конец = 25;
			Шаг = 1;
			ВыделенныеЗначения.Добавить(16);
			ВыделенныеЗначения.Добавить(20);
			
		ИначеЕсли Элемент = Элементы.НасыщениеКислородом Тогда
			Начало = 100;
			Конец = 80;
			Шаг = -1;
			ВыделенныеЗначения.Добавить(95);
			ВыделенныеЗначения.Добавить(90);
		КонецЕсли;
		
		ДанныеВыбора = Новый СписокЗначений;
		Текущее = Начало;
		Пока	 (Шаг > 0 И Текущее <= Конец)
			Или  (Шаг < 0 И Текущее >= Конец)
		Цикл
			
			Если ВыделенныеЗначения.Найти(Текущее) <> Неопределено Тогда
				Представление = Новый ФорматированнаяСтрока(Строка(Текущее), Новый Шрифт(,,Истина));
			Иначе
				Представление = Неопределено;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(Текущее, Представление);
			Текущее = Текущее + Шаг;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Дата = Дата + Направление * 60 * 10;
	ПересчитатьЭтоВечер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПриИзменении(Элемент)
	ПересчитатьЭтоВечер();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЭтоВечер()
	ЭтоВечер = (Дата - НачалоДня(Дата)) >= 50400; // Позже 14:00 - вечер.
КонецПроцедуры
